meeting/agenda/2025/07-22.org
:PROPERTIES:
:ID:       B96339DA-45F9-4445-871B-4A76F9F557EC
:END:
#+title: QT4 CG Meeting 130 Agenda 2025-07-22
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/07-15.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 22 July 2025. The following meeting is scheduled
for 29 July 2025.

The CG will not meet 5 August. Does the CG wish to take a longer “summer holiday”?

** Review of open action items [0/10]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.
+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-123-01: MK to do the set example in XQuery.
+ [ ] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [ ] QT4CG-128-01 CG to consider using “standard” or some other term instead of “regular” in the file: module.
+ [ ] QT4CG-128-02 CG to investigate what to say about permissions.
+ [ ] QT4CG-128-03 NW to compare the file: module against the equivalent XProc 3.1 steps
+ [ ] QT4CG-129-01: MK to fix the remaining prose references to MapKeyExpr and MapValueExpr

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2063][#2063]]: 1996 Lookups, KeySpecifier: Literal, ContextValueRef
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2108][#2108]]: QT4CG-123-01 Add example of library module using methods
+ PR [[https://qt4cg.org/dashboard/#pr-2107][#2107]]: QT4CG-129-01: Actions from review of PR2094
+ PR [[https://qt4cg.org/dashboard/#pr-2106][#2106]]: Add note on the impossibility of cyclic instances
+ PR [[https://qt4cg.org/dashboard/#pr-2105][#2105]]: Fix type of `fn:schema-type-record` field `constructor`

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2097][#2097]]: `jnode` as a subtype of `node`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2089][#2089]]: JNode properties: Presentation

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2109][#2109]]: 2103 Allow operand of JNode accessors to be omitted or empty
+ PR [[https://qt4cg.org/dashboard/#pr-2110][#2110]]: 2098 Clarify when jnode() is called implicitly
+ PR [[https://qt4cg.org/dashboard/#pr-2111][#2111]]: 2095 Point out places where jnode-content is called implicitly
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2037][#2037]]: 2036 Add rule for streamability of xsl:map
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2109: 2103 Allow operand of JNode accessors to be omitted or empty
:PROPERTIES:
:CUSTOM_ID: pr-2109
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2109][#2109]]

** PR #2110: 2098 Clarify when jnode() is called implicitly
:PROPERTIES:
:CUSTOM_ID: pr-2110
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2110][#2110]]

** PR #2111: 2095 Point out places where jnode-content is called implicitly
:PROPERTIES:
:CUSTOM_ID: pr-2111
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2111][#2111]]

** PR #2071: 77c deep update
:PROPERTIES:
:CUSTOM_ID: pr-2071
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]

** PR #2037: 2036 Add rule for streamability of xsl:map
:PROPERTIES:
:CUSTOM_ID: pr-2037
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2037][#2037]]

** PR #2019: 1776: XSLT template rules for maps and array
:PROPERTIES:
:CUSTOM_ID: pr-2019
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]


* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

