meeting/agenda/2025/07-22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 130 Agenda 2025-07-22</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 130 Agenda 2025-07-22</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/07-15.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 22 July 2025. The following meeting is scheduled
for 29 July 2025.
</p>

<p>
The CG will not meet 5 August. Does the CG wish to take a longer “summer holiday”?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/10]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-112-01: JLO to propose a concrete example that uses “.” in a ~%method~s.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-123-01: MK to do the set example in XQuery.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-01 CG to consider using “standard” or some other term instead of “regular” in the file: module.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-02 CG to investigate what to say about permissions.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03 NW to compare the file: module against the equivalent XProc 3.1 steps</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-129-01: MK to fix the remaining prose references to MapKeyExpr and MapValueExpr</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2063">#2063</a>: 1996 Lookups, KeySpecifier: Literal, ContextValueRef</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2108">#2108</a>: QT4CG-123-01 Add example of library module using methods</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2107">#2107</a>: QT4CG-129-01: Actions from review of PR2094</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2106">#2106</a>: Add note on the impossibility of cyclic instances</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2105">#2105</a>: Fix type of `fn:schema-type-record` field `constructor`</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2097">#2097</a>: `jnode` as a subtype of `node`</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2089">#2089</a>: JNode properties: Presentation</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2109">#2109</a>: 2103 Allow operand of JNode accessors to be omitted or empty</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2110">#2110</a>: 2098 Clarify when jnode() is called implicitly</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2111">#2111</a>: 2095 Point out places where jnode-content is called implicitly</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2037">#2037</a>: 2036 Add rule for streamability of xsl:map</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-2109" class="outline-3">
<h3 id="pr-2109"><span class="section-number-3">2.1.</span> PR #2109: 2103 Allow operand of JNode accessors to be omitted or empty</h3>
<div class="outline-text-3" id="text-pr-2109">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2109">#2109</a>
</p>
</div>
</div>

<div id="outline-container-pr-2110" class="outline-3">
<h3 id="pr-2110"><span class="section-number-3">2.2.</span> PR #2110: 2098 Clarify when jnode() is called implicitly</h3>
<div class="outline-text-3" id="text-pr-2110">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2110">#2110</a>
</p>
</div>
</div>

<div id="outline-container-pr-2111" class="outline-3">
<h3 id="pr-2111"><span class="section-number-3">2.3.</span> PR #2111: 2095 Point out places where jnode-content is called implicitly</h3>
<div class="outline-text-3" id="text-pr-2111">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2111">#2111</a>
</p>
</div>
</div>

<div id="outline-container-pr-2071" class="outline-3">
<h3 id="pr-2071"><span class="section-number-3">2.4.</span> PR #2071: 77c deep update</h3>
<div class="outline-text-3" id="text-pr-2071">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>
</p>
</div>
</div>

<div id="outline-container-pr-2037" class="outline-3">
<h3 id="pr-2037"><span class="section-number-3">2.5.</span> PR #2037: 2036 Add rule for streamability of xsl:map</h3>
<div class="outline-text-3" id="text-pr-2037">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2037">#2037</a>
</p>
</div>
</div>

<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.6.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>
</p>
</div>
</div>
</div>


<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
